incompressible/adjointOptimisationFoam/twoCylindersInLine/fullStorage/0.orig/pa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2004                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pa;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topBottom
    {
        type            zeroGradient;
    }
    outlet
    {
        type            adjointOutletPressure;
        value           uniform 0;
    }
    inlet
    {
        type            zeroGradient;
    }
    cylinder1
    {
        type            zeroGradient;
    }
    cylinder2
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
