incompressible/adjointOptimisationFoam/twoCylindersInLine/fullStorage/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     adjointOptimisationFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.348;

nOptimisationCycles 1;

deltaT          0.001;

writeControl    timeStep;

writeInterval   50000000; // avoid intermediate writing

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression yes;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.7;

maxDeltaT       1;

functions
{
}


// ************************************************************************* //
