incompressible/adjointOptimisationFoam/twoCylindersInLine/fullStorage/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2004                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default          Gauss linear;
    gradUConv        cellLimited Gauss linear 0.5;
    gradUaConv       cellLimited Gauss linear 0.5;
}

divSchemes
{
    default                             Gauss linear;

    div(phi,U)                          Gauss linearUpwind gradUConv;
    div(-phi,Ua)                        Gauss linearUpwind gradUaConv;
}

laplacianSchemes
{
    default                             Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
