incompressible/adjointOptimisationFoam/twoCylindersInLine/fullStorage/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2004                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    "(p|pa).*"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1.e-7;
        relTol           0.05;
    }
    "(p|pa).*Final"
    {
        $p;
        relTol           0;
    }
    "(U|Ua).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.1;
        minIter         1;
    }
    "(U|Ua).*Final"
    {
        $U;
        relTol          0;
    }
}

relaxationFactors
{
    fields
    {
        "p.*"           0.9;
        "pa.*"          1.;
    }
    equations
    {
        "U.*"           1.;
        "Ua.*"          1.;
    }
}

// ************************************************************************* //
